spec/fixtures/vcr/PaypalOrder/paypal/can_create_a_payment_on_PayPal.yml

---
http_interactions:
- request:
    method: post
    uri: https://foo:bar@api.sandbox.paypal.com/v1/oauth2/token
    body:
      encoding: US-ASCII
      string: grant_type=client_credentials
    headers:
      User-Agent:
      - PayPalSDK/rest-sdk-ruby 0.6.0 (paypal-sdk-core 0.2.6; ruby 1.9.3p448-x86_64-darwin13.0.0)
      Content-Type:
      - application/x-www-form-urlencoded
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      Proxy-Server-Info:
      - host=slcsbjava3.slc.paypal.com;threadId=127
      Paypal-Debug-Id:
      - b2a19d7092f2a
      Content-Type:
      - application/json
      Content-Length:
      - '282'
      Dc:
      - origin1-api.sandbox.paypal.com
      Date:
      - Mon, 11 Nov 2013 00:04:30 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - DC=origin1-api.sandbox.paypal.com; secure
    body:
      encoding: US-ASCII
      string: ! '{"scope":"https://api.paypal.com/v1/payments/.* https://api.paypal.com/v1/vault/credit-card
        https://api.paypal.com/v1/vault/credit-card/.* openid","access_token":"","token_type":"Bearer","app_id":"APP-xxxxxxx","expires_in":28800}'
    http_version: 
  recorded_at: Mon, 11 Nov 2013 00:04:30 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment
    body:
      encoding: US-ASCII
      string: ! '{"intent":"sale","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"currency":"EUR","total":"9.00"},"item_list":{"items":[{"quantity":"1","name":"serveme.tf
        - 1 year","price":"9.00","currency":"EUR"}]}}],"redirect_urls":{"return_url":"http://localhost:3000/paypal_orders/redirect/?order_id=45","cancel_url":"http://localhost:3000/paypal_orders/new"}}'
    headers:
      Authorization:
      - Bearer foobartoken
      Content-Type:
      - application/json
      User-Agent:
      - PayPalSDK/rest-sdk-ruby 0.6.0 (paypal-sdk-core 0.2.6; ruby 1.9.3p448-x86_64-darwin13.0.0)
      Paypal-Request-Id:
      - 45212d5e-6068-4b46-84fc-ddd289fd31b6
      Accept:
      - ! '*/*'
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - Apache-Coyote/1.1
      Proxy-Server-Info:
      - host=slcsbjava3.slc.paypal.com;threadId=382
      Paypal-Debug-Id:
      - f988cd5f93379
      Content-Language:
      - ! '*'
      Content-Type:
      - application/json
      Content-Length:
      - '819'
      Dc:
      - origin1-api.sandbox.paypal.com
      Date:
      - Mon, 11 Nov 2013 00:04:31 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - DC=origin1-api.sandbox.paypal.com; secure
    body:
      encoding: US-ASCII
      string: ! '{"id":"PAY-xxxxxxxxxxxxxxxxxx","create_time":"2013-11-11T00:04:30Z","update_time":"2013-11-11T00:04:31Z","state":"created","intent":"sale","payer":{"payment_method":"paypal","payer_info":{"shipping_address":{}}},"transactions":[{"amount":{"total":"9.00","currency":"EUR","details":{"subtotal":"9.00"}},"item_list":{"items":[{"name":"serveme.tf
        - 1 year","price":"9.00","currency":"EUR","quantity":"1"}]}}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-xxxxxxxxxxxxxxxxxx","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-xxxxxxxx","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-xxxxxxxxxxxxxxxx/execute","rel":"execute","method":"POST"}]}'
    http_version: 
  recorded_at: Mon, 11 Nov 2013 00:04:31 GMT
recorded_with: VCR 2.7.0
